Catalogs/усд_УсловияВыполненияОперацийПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>усд_УсловияВыполненияОперацийПоДокументам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ВидыДокументов</xr:Item>
				<xr:Item>Catalog.фин_КлассификаторРегистров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсеУсловияОбязательны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеЧастиУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.усд_ВидыСравненияДляУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляСравнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляСравнения2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>501</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПараметрыСоединенияСИсточником</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеИсточникаДляСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеИсточникаДляСравнения2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизвольныйИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.усд_РежимыСравненияДляУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСписокСравнения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПараметрыСоединенияСИсточником</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаСписокСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/усд_ВидыСравненияДляУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>усд_ВидыСравненияДляУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяГраницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/усд_РежимыСравненияДляУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>усд_РежимыСравненияДляУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СравнениеСПроизвольнымЗначением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СравнениеСПолемРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СравнениеСПолемПроизвольногоИсточника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/усд_УсловияВыполненияОперацийПоДокументам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция ПолучитьОписаниеУсловия(ВыбранныеДанные) Экспорт
		
		Текст = "";
		
		мВидСравнения = ВыбранныеДанные.ВидСравнения;
		ЭтоСписок = Ложь;
		Если мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВСписке 
				ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВСпискеПоИерархии
				ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеВСписке
				ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеВСпискеПоИерархии Тогда
			ЭтоСписок = Истина;
		КонецЕсли;
		//Если Найти(ВыбранныеДанные.ИмяРеквизита,"АвтовыборПоТипу:")<>0 Тогда
		//	Если ВыбранныеДанные.УсловиеНаВложенноеПоле Тогда
		//		Текст = Текст + "Вложенное поле """+ВыбранныеДанные.ВложенноеПоле+""" значения субконто типа """+Строка(ТипЗнч(ВыбранныеДанные.Типизатор))+""" - " + Символы.ПС;
		//	Иначе
		//		Текст = Текст + "Значение субконто типа """+Строка(ТипЗнч(ВыбранныеДанные.Типизатор))+""" - " + Символы.ПС;
		//	КонецЕсли;
		//КонецЕсли;
		Текст = Текст + "Поле: " + ВыбранныеДанные.ПредставлениеРеквизита + Символы.ПС + " (программное имя: "+ВыбранныеДанные.ИмяРеквизита+") " + Символы.ПС + ВРег(ВыбранныеДанные.ВидСравнения)+" ";
		Если ВыбранныеДанные.РежимСравнения = Перечисления.усд_РежимыСравненияДляУсловий.СравнениеСПроизвольнымЗначением Тогда
			Если ЭтоСписок Тогда
				//Если ЗначениеЗаполнено(ВыбранныеДанные.ПредопределенныйСписок) Тогда
				//	Текст = Текст + Строка(ВыбранныеДанные.ПредопределенныйСписок);
				//Иначе
					СписокЗначений = ?(ВыбранныеДанные.СтрокаСписокСравнения="",Новый СписокЗначений,ЗначениеИзСтрокиВнутр(ВыбранныеДанные.СтрокаСписокСравнения));
					ПредставлениеСписка = "";
					Для Каждого СтрокаСписка Из СписокЗначений Цикл
						ПредставлениеСписка = ПредставлениеСписка + ?(ПредставлениеСписка="","","; ")+Строка(СтрокаСписка.Значение);
					КонецЦикла;
					Текст = Текст +": " + ПредставлениеСписка;
				//КонецЕсли;
			ИначеЕсли мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервале ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервалеВключаяГраницы Тогда
				Текст = Текст + ": от " + Строка(ВыбранныеДанные.ЗначениеДляСравнения) + " до "+ Строка(ВыбранныеДанные.ЗначениеДляСравнения2);
			Иначе
				Текст = Текст + Строка(ВыбранныеДанные.ЗначениеДляСравнения);
			КонецЕсли;
		ИначеЕсли ВыбранныеДанные.РежимСравнения = Перечисления.усд_РежимыСравненияДляУсловий.СравнениеСПолемРегистраСведений Тогда
			Попытка
				Регистр = Метаданные.РегистрыСведений[ВыбранныеДанные.ИсточникДанных].Синоним;
			Исключение
				Регистр = ВыбранныеДанные.ИсточникДанных;
			КонецПопытки;
			Если мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервале ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервалеВключаяГраницы Тогда
				Текст = Текст + ": от значения поля """ + ВыбранныеДанные.ПолеИсточникаДляСравнения + """ до значения поля """+ ВыбранныеДанные.ПолеИсточникаДляСравнения2+""" регистра сведений """+Регистр+"""";
			Иначе
				Текст = Текст + "значение поля """+ВыбранныеДанные.ПолеИсточникаДляСравнения+""" регистра сведений """+Регистр+"""";
			КонецЕсли;
		ИначеЕсли ВыбранныеДанные.РежимСравнения = Перечисления.усд_РежимыСравненияДляУсловий.СравнениеСПолемПроизвольногоИсточника Тогда
			Если мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервале ИЛИ мВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИнтервалеВключаяГраницы Тогда
				Текст = Текст + ": от значения поля """ + ВыбранныеДанные.ПолеИсточникаДляСравнения + """ до значения поля """+ ВыбранныеДанные.ПолеИсточникаДляСравнения2+""" настроенного пользователем запроса";
			Иначе
				Текст = Текст + "значение поля """+ВыбранныеДанные.ПолеИсточникаДляСравнения+""" настроенного пользователем запроса";
			КонецЕсли;
		КонецЕсли;
		
		
		Возврат Текст;
	КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли
